# vsoPFCSetChanged

## Description
Provide the object Changed result for the PrepareForContext (79) message sent to a Script object.

```pascal
PROCEDURE vsoPFCSetChanged(
				message   : LONGINT;
				didChange : BOOLEAN);
```

```python

def vs.vsoPFCSetChanged(message, didChange):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|LONGINT||
|didChange|BOOLEAN||

## Version
Availability: from Vectorworks 2023
## Category
* Object Events